ErpTest/src/Documents/уатОтклонениеГруза/уатОтклонениеГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатОтклонениеГруза</name>
  <comment>Закрытие заказов на ТС</comment>
  <basedOn>Document.уатЗаказГрузоотправителя</basedOn>
  <registerRecords>AccumulationRegister.уатЗаказыГрузоотправителей</registerRecords>
  <registerRecords>InformationRegister.уатПричиныОтклоненияЗаказов</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>ЗаказГрузоотправителя</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтклонения</name>
      <comment>Причина закрытия</comment>
      <type>
        <types>CatalogRef.уатПричиныЗакрытияЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/уатПричиныОтклоненияЗаказов/уатПричиныОтклоненияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатПричиныОтклоненияЗаказов</name>
  <comment>(уат)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.уатПричиныЗакрытияЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Documents/уатОтклонениеГруза/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.уатОтклонениеГруза.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение.ОтразитьЗаказыГрузоотправителей(ДополнительныеСвойства, Движения, Отказ);
	
	уатПроведение.ОтразитьПричиныЗакрытияЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатОтклонениеГруза.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.уатОтклонениеГруза.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументОбъект.уатЗаказГрузоотправителя") Или 
				ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;
		Заказчик = ДанныеЗаполнения.Контрагент;
		НоваяСтрока = Заказы.Добавить();
		НоваяСтрока.ЗаказГрузоотправителя = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	//проверяем не был ли уже закрыт заказ
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатПричиныОтклоненияЗаказов.Регистратор,
	|	уатПричиныОтклоненияЗаказов.ПричинаОтклонения,
	|	уатПричиныОтклоненияЗаказов.Заказ
	|ИЗ
	|	РегистрСведений.уатПричиныОтклоненияЗаказов КАК уатПричиныОтклоненияЗаказов
	|ГДЕ
	|	уатПричиныОтклоненияЗаказов.Заказ В(&СписокЗаказов)
	|	И уатПричиныОтклоненияЗаказов.Регистратор <> &Ссылка");
	Запрос.УстановитьПараметр("СписокЗаказов", Заказы.ВыгрузитьКолонку("ЗаказГрузоотправителя"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	тблЗакрытиеЗаказов = Запрос.Выполнить().Выгрузить();
	Если тблЗакрытиеЗаказов.Количество() > 0 Тогда
		СтрокаСообщения = "В табличной части ""Заказы"" присутствуют уже закрытые заказы:";
		Для Каждого ТекСтрока Из тблЗакрытиеЗаказов Цикл
			СтрокаСообщения = СтрокаСообщения + "
			|	""" + ТекСтрока.Заказ + """, закрыт документом """ + ТекСтрока.Регистратор + """, по причине """ +
					ТекСтрока.ПричинаОтклонения + """";
		КонецЦикла;
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;
	
	ТЗ = Заказы.Выгрузить();
	ТЗ.Свернуть("ЗаказГрузоотправителя");
	Если ТЗ.Количество() <> Заказы.Количество() Тогда
		СтрокаСообщения = "В табличной части ""Заказы"" присутствуют дубли строк.";
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;
КонецПроцедуры
